//TECN005V JOB 'DEV','SAI',CLASS=A,
// MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//SET1 SET NAME=TKOL055.TEST.PS,U=TRK,P=1,S=1
//DD1 DD DSN=&NAME,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(&U,(&P,&S)),
// DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//STEP2 EXEC PGM=IEFBR14
//SET2 SET NAME=TKOL055.TEST.PDS,U=TRK,P=1,S=1,D=1
//DD1 DD DSN=&NAME,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(&U,(&P,&S,&D)),
// DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)