//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=TECN005.SAMP.TEST.PS1,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(1,1)),
// DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//STEP2 EXEC PGM=IEBGENER,COND=ONLY
//SYSUT1 DD *
  THIS JOB IS TO TEST ABEND
/*
//SYSUT2 DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
