//TECN005V JOB NOTIFY=&SYSUID
//   JCLLIB ORDER=TECN005.MYPROC.JCL
//DSCRT PROC
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=TECN005.EMPLOY.BCKUP.PS,
// DISP=(NEW,CATLG,DELETE),
// LIKE=TECN005.EMPDET.PS3
//     PEND
//STEP2 EXEC DSCRT
//STEP3 EXEC PSCOPY,INP=TECN005.EMPDET.PS3,
// OUT=TECN005.EMPLOY.BCKUP.PS
//STEP4 EXEC DSCRT
//STEP1.DD1 DD DSN=TECN005.EMPDET.PS3,
// DISP=(OLD,DELETE,DELETE)
