//KSDSCRT  PROC                                                         00010000
//PSTEP1   EXEC PGM=IDCAMS                                              00020000
//SYSPRINT DD SYSOUT=*                                                  00030000
//SYSIN    DD DSN=TECN116.JCL.MYPROC(MYCTL01),DISP=SHR                  00040000
//KSDSCRT  PEND                                                         00050000
