//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  DEFINE GDG (NAME(TECN005.TEST.BCK.GDG1)-
  LIMIT(5) -
  NOEMPTY  -
  SCRATCH)
/*