//TECN005V JOB 001,CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=TKOL055.SAMP.PS,DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(1,1)),DCB=(LRECL=80,RECFM=FB,BLKSIZE=800)
//SYSABEND DD SYSOUT=A
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY