//TKOL055@ JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=TKOL055.MYLIB.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=COBCS01M
//INCUSPS  DD DSN=TKOL055.MYDATA.CS01.PS1A,DISP=SHR
//OUTCUSPS DD DSN=TKOL055.MYDATA.OUTPUT.PS2A,DISP=SHR
//SYSIN DD *
/*
