//TECN005V JOB 'DEV','SAI',CLASS=A,
// MSGCLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=TKOL055.TEST.PS,
//  DISP=(OLD,CATLG,DELETE),
//  SPACE=(TRK,(3,3)),
//  DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)