//TECN005V JOB NOTIFY=&SYSUID,TYPRUN=SCAN
//STEP01 EXEC PGM=IEFBR14
//DD1 DD DSN=TKOL055.MYLIB.JCL1(JCLEX06),
//   DISP=(OLD,CATLG,DELETE),
//   SPACE=(TRK,(1,1)),
//   DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)