//TECN005V JOB NOTIFY=&SYSUID
//STEP01 EXEC PGM=IEFBR14
//DD1 DD DSN=TKOL055.MYDATA.PS1,
//   DISP=(NEW,CATLG,DELETE),
//   SPACE=(TRK,(1,1)),
//   DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)