//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=TKOL055.MYDATA.PS2,
//   DISP=(NEW,CATLG,DELETE),
//   SPACE=(TRK,(1,1)),
//   DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//STEP2 EXEC PGM=IEFBR14
//DD1 DD DSN=TKOL055.MYDATA.PDS2,
//   DISP=(NEW,CATLG,DELETE),
//   SPACE=(TRK,(1,1,5)),
//   DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
