//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOMPR
//SYSUT1 DD DSN=TKOL055.EMPDET.COPY.PS1,DISP=SHR
//SYSUT2 DD DSN=TKOL055.EMPDET.PS1,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  COMPARE TYPORG=PS
/*