//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//DD1 DD DSN=TKOL055.EMPDET.PS1,DISP=SHR
//DD2 DD DSN=TKOL055.EMPLOY.DETAILS.PS2,DISP=SHR
//SYSIN DD *
  REPRO INFILE(DD1) OUTFILE(DD2) SKIP(4) COUNT(5)
/*
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  PRINT INDATASET(TKOL055.EMPLOY.DETAILS.PS2) CHAR
/*