  DEFINE CLUSTER( -
  NAME(TECN002.JCL.ASSMT02.SHARE.KSDS) -
  RECORDSIZE (80,80) -
  TRACKS(5,5) -
  VOLUME(ZAPRD7) -
  FREESPACE(10,10) -
  CONTROLINTERVALSIZE(512) -
  KEYS(5,0) -
  INDEXED)