        IDENTIFICATION DIVISION.
        PROGRAM-ID. CDBEX04.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WSS-ERR-MSG.
            05 WS-ERR-MSG.
              10 WS-ERR-LEN        PIC  S9(4) COMP VALUE 800.
              10 WS-ERR-TEXT       PIC  X(80) OCCURS 10 TIMES.
            05 WS-ERR-LRECL        PIC  S9(4) COMP VALUE 80.
        01 WSS-SQLCODE             PIC  S9(3) SIGN LEADING SEPARATE.
            88 WS-EOT              VALUE  +100.
            88 WS-SUCCESS          VALUE  +000.
            EXEC SQL INCLUDE SQLCA END-EXEC.
            EXEC SQL INCLUDE EMPDCL END-EXEC.
            EXEC SQL INCLUDE DEPTDCL END-EXEC.
            EXEC SQL
            DECLARE CS-TB-EMPDEPS CURSOR FOR
            SELECT COUNT(EMPNO) AS EMPCOUNT, WORKDEPT,
            MAX(SALARY) AS MAXSAL, DEPTNAME, LOCATION FROM
            GEN_DEPARTMENT,GEN_EMPLOYEE
            WHERE WORKDEPT = DEPTNO GROUP BY WORKDEPT,DEPTNAME,
            LOCATION
            ORDER BY WORKDEPT
            END-EXEC.
        01 WS-CNT-EMP              PIC S9(4) USAGE COMP.
        01 WS-MAX-SAL              PIC S9(7)V9(2) USAGE COMP-3.
        01 WS-WORKDEPT             PIC X(3).
        01 WS-DEPTNAME             PIC X(40).
        01 WS-LOCATION             PIC X(20).
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
                 PERFORM 1000-INITIALIZATION-PARA THRU
                 1000-INITIALIZATION-PARA-EXIT
                 PERFORM 2000-PROCESS-PARA THRU
                 2000-PROCESS-PARA-EXIT
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT.
        0000-MAIN-PARA-EXIT.
                 EXIT.
        1000-INITIALIZATION-PARA.
        1000-INITIALIZATION-PARA-EXIT.
                 EXIT.
        2000-PROCESS-PARA.
                 PERFORM 2100-OPEN-PARA THRU
                 2100-OPEN-PARA-EXIT
                 PERFORM 2200-FETCH-PARA THRU
                 2200-FETCH-PARA-EXIT UNTIL WS-EOT
                 PERFORM 3000-CLOSE-PARA THRU
                 3000-CLOSE-PARA-EXIT.
        2000-PROCESS-PARA-EXIT.
                 EXIT.
        2100-OPEN-PARA.
                 EXEC SQL OPEN CS-TB-EMPDEPS END-EXEC.
                 MOVE SQLCODE TO WSS-SQLCODE
                 EVALUATE TRUE
                 WHEN WS-SUCCESS
                 CONTINUE
                 WHEN WS-EOT
                 CONTINUE
                 WHEN OTHER
                 DISPLAY 'CURSOR NOT OPENED'
                 DISPLAY 'ERROR STATUS' SQLCODE
                 CALL 'DSNTIAR' USING SQLCA, WS-ERR-MSG WS-ERR-LRECL
                 DISPLAY WS-ERR-MSG
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT
                 END-EVALUATE.
        2100-OPEN-PARA-EXIT.
                 EXIT.
        2200-FETCH-PARA.
                 EXEC SQL FETCH CS-TB-EMPDEPS INTO :WS-CNT-EMP,
                 :WORKDEPT, :WS-MAX-SAL, :DEPTNAME, :LOCATION
                 END-EXEC.
                 MOVE SQLCODE TO WSS-SQLCODE
                 EVALUATE TRUE
                 WHEN WS-SUCCESS
                 PERFORM 2300-MOVE-PARA THRU
                 2300-MOVE-PARA-EXIT
                 WHEN WS-EOT
                 CONTINUE
                 WHEN OTHER
                 DISPLAY 'CURSOR NOT FETCHED'
                 DISPLAY 'ERROR STATUS' SQLCODE
                 CALL 'DSNTIAR' USING SQLCA, WS-ERR-MSG WS-ERR-LRECL
                 DISPLAY WS-ERR-MSG
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT
                 END-EVALUATE.
         2200-FETCH-PARA-EXIT.
                 EXIT.
         3000-CLOSE-PARA.
                 EXEC SQL CLOSE CS-TB-EMPDEPS END-EXEC.
                 MOVE SQLCODE TO WSS-SQLCODE
                 EVALUATE TRUE
                 WHEN WS-SUCCESS
                 CONTINUE
                 WHEN OTHER
                 DISPLAY 'CURSOR NOT CLOSED'
                 DISPLAY 'ERROR STATUS' SQLCODE
                 CALL 'DSNTIAR' USING SQLCA, WS-ERR-MSG WS-ERR-LRECL
                 DISPLAY WS-ERR-MSG
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT
                 END-EVALUATE.
         3000-CLOSE-PARA-EXIT.
                 EXIT.
         2300-MOVE-PARA.
                 MOVE WORKDEPT TO WS-WORKDEPT
                 MOVE DEPTNAME-TEXT TO WS-DEPTNAME
                 MOVE LOCATION TO WS-LOCATION
                 DISPLAY 'EMP COUNT:' WS-CNT-EMP
                 DISPLAY 'WORKDEPT :' WS-WORKDEPT
                 DISPLAY 'MAX SALARY:' WS-MAX-SAL
                 DISPLAY 'DEPTNAME :' WS-DEPTNAME
                 DISPLAY 'LOCATION :' WS-LOCATION
                 MOVE SPACES TO WS-WORKDEPT
                 MOVE SPACES TO DEPTNAME-TEXT
                 MOVE SPACES TO LOCATION.
         2300-MOVE-PARA-EXIT.
                 EXIT.
         9000-TERMINATION-PARA.
                 STOP RUN.
         9000-TERMINATION-PARA-EXIT.
                 EXIT.
         9100-CURSOR-CLOSE-PARA-EXIT.
                 EXIT.
