//TECN005V JOB  'DEV',CLASS=A,NOTIFY=&SYSUID
//INPROC   PROC
//STEP1    EXEC PGM=IEFBR14
//DD1      DD DSN=&SP,DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(1,1)),DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//       PEND
//STEP2    EXEC PROC=INPROC,SP=TECN005.SAMPLE.TEST.PS1
//STEP3    EXEC PROC=INPROC,SP=TECN005.SAMPLE.TEST.PS2
//STEP4    EXEC PROC=INPROC,SP=TECN005.SAMPLE.TEST.PS3
//STEP5    EXEC PROC=INPROC,SP=TECN005.SAMPLE.TEST.PS4