//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//INDD DD DSN=TECN005.EMPDET.PS1,
//        DISP=SHR
//OUTDD DD DSN=TECN005.TEST.BCK.GDG1(+1),
//        DISP=(NEW,CATLG,DELETE),
//        SPACE=(TRK,(5,5)),
//        DCB=(LRECL=130,BLKSIZE=1300,RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  REPRO INFILE(INDD)
        OUTFILE(OUTDD)
/*