//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//DD1 DD DSN=TECN005.TEST.BCK.GDG1(+0),
//       DISP=OLD
//SYSIN DD *
    PRINT INFILE(DD1) CHAR
/*