//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//DD1 DD DSN=TECN005.TEST.BCK.GDG1(0),
//       DISP=(OLD,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY
//IF1 IF (STEP1.RC) = 0 THEN
//STEP2 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
     DELETE TECN005.TEST.BCK.GDG1
/*
// ENDIF