//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=SORT
//SORTIN DD DSN=TKOL055.EMPREC.PS1,DISP=SHR
//SORTOUT DD DSN=TKOL055.EMPREC.TOTAL.PS1,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(1,1)),
// DCB=(LRECL=80,BLKSIZE=80,RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
  SORT FIELDS=(20,2,CH,A)
  SUM FIELDS=(23,6,ZD)
/*