//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=SORT
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SORTIN1 DD DSN=TKOL055.EMPREC.CS.PS1,DISP=SHR
//SORTIN2 DD DSN=TKOL055.EMPREC.IT.PS1,DISP=SHR
//SORTOUT DD DSN=TKOL055.MERGE.PS1,
// DISP=(MOD,CATLG,DELETE),
// LIKE=TKOL055.EMPREC.PS1
//SYSIN DD *
  MERGE FIELDS=(1,6,CH,A)
/*