//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=SORT
//SORTIN DD DSN=TKOL055.EMPREC.PS1,DISP=SHR
//SORTOUT DD DSN=TKOL055.EMPREC.SORT.PS1,
//  DISP=(MOD,CATLG,DELETE),
//  SPACE=(TRK,(1,1)),
//  DCB=(LRECL=80,BLKSIZE=80,RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
  SORT FIELDS=(1,6,CH,A,20,2,CH,A)
/*