//USERID JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=SORT
//SYSPRINT DD 
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=USERID.VSAM,DISP=SHR
//SORTOUT  DD DSN=USERID.VSAM,DISP=OLD
//SYSIN    DD *
  SORT FIELDS=(1,6,ZD,A)
/*
//STEP2 EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN01 DD DSN=USERID.VSAM,DISP=SHR
//SORTIN02 DD DSN=USERID.VSAM.OLD,DISP=SHR
//SORTOUT  DD DSN=USERID.VSAM,DISP=OLD
//SYSIN    DD *
  MERGE FIELDS=(1,6,ZD,A)
/* 