JCL

//USERID  JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//SYSOUT   DD  SYSOUT=*
//SORTIN   DD  DSN=USERID.OUTFILE,DISP=SHR
//SORTOUT  DD  DSN=USERID.OUTFILE,DISP=OLD
//SYSIN    DD  *
  INREC OVERLAY=(81:(11,10,ZD,SUB,21,10,ZD,MUL,+100,DIV,11,10,ZD))
  SORT FIELDS=(81,10,ZD,A)
/*


SQL

SELECT T1.* FROM TABLE1 T1 LEFT JOIN TABLE2 ON T1.EMP_ID = T2.EMP_ID
WHERE T2.EMP_ID IS NULL;