//USERID JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
    DEFINE GDG(NAME(USERID.GDG)-
                LIMIT 10-
                EMPTY-
                NO-SCRATCH)
*/

//STEP2 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY
//SYSUT1 DD DSN=USERID.OUTPUT,DISP=SHR
//SYSUT2 DD DSN=USERID.GDG(+1),DISP=(NEW,CATLG,DELETE),
//  SPACE=(TRK,(1,1)),DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)








