//TKOL055@ JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=TKOL055.MYLIB.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=COBCS02M
//INCUSPS  DD DSN=TKOL055.MYDATA.CS01.PS1,DISP=SHR
//OUTCUSPS DD DSN=TKOL055.MYDATA.CS02.REPORT.PS,DISP=SHR
//SYSIN DD *
/*
