//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSUT1 DD *
  WELCOME TO MAINFRAME
  IEBGENER UTILITY EXAMPLE
/*
//SYSUT2 DD DSN=TKOL055.MYDATA.PS1,
//  DISP=(NEW,CATLG,DELETE),
//  SPACE=(TRK,(1,1)),
//  DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY