//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEFBR14
//DD1 DD DSN=TKOL055.EMPDET.COPY.PS1,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(1,1)),
// DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//STEP2 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=TKOL055.EMPDET.PS3,DISP=SHR
//SYSUT2 DD DSN=TKOL055.EMPDET.COPY.PS1,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY