//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBGENER
//SYSUT1 DD DSN=TKOL055.EMPDET.COPY.PS1,DISP=SHR
//       DD DSN=TKOL055.MYDATA.PS1,DISP=SHR
//SYSUT2 DD DSN=TKOL055.EMPDET.ALL.PS1,
//  DISP=(NEW,CATLG,DELETE),
//  SPACE=(TRK,(1,1)),
//  DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSIN DD DUMMY