//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  REPRO INDATASET(TKOL055.EMPDET.PS1)-
  OUTDATASET(TKOL055.EMPLOY.DETAILS.PS1) SKIP(0) COUNT(3)
/*