//TECN005V JOB NOTIFY=&SYSUID
//STEP1 EXEC PGM=IEBCOPY
//DD1 DD DSN=TKOL055.MYLIB.JCL1,DISP=SHR
//DD2 DD DSN=TKOL055.BACKUP.JCL1,
// DISP=(NEW,CATLG,DELETE),
// SPACE=(TRK,(5,5,5)), 
// DCB=(LRECL=80,BLKSIZE=800,RECFM=FB)
//SYSPRINT DD SYSOUT=*
//SYSIN DD *
  COPY INDD=DD1,OUTDD=DD2
  SELECT MEMBER=JCLEX01,JCLEX03,JCLEX05,JCLEX07
/*