//TECN116H JOB NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER(                   -
  NAME(TECN116.FP.MASTER.LOAN.KSDS) -
  KEYS(12,0) -
  TRACK(3,3) -
  CISZ(512)  -
  RECSZ(300,300) -
  VOLUME(ZAPRD7) -
  FREESPACE(10,10) -
  REUSE -
  INDEXED )
/*
