//TEKUS00@ JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=TEKUS00.MYLIB.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=COBCS05
//INPDTPS DD DSN=TEKUS00.MYDATA.CS05.PRODUCT.PS,DISP=SHR
//OUTPDTPS DD DSN=TEKUS00.MYDATA.CS05.OUTPUT.PS,DISP=SHR
//SYSIN DD *
/*
