//TEKUS00@ JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=TEKUS00.MYLIB.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=COBCS04
//INPKS DD DSN=TEKUS00.MYDATA.CS03.KSDS,DISP=SHR
//INPTX01 DD DSN=TEKUS00.MYDATA.CS04.TXN.PS,DISP=SHR
//OUTPS01 DD DSN=TEKUS00.MYDATA.CS04.OUTPUT.PS,DISP=SHR
//SYSIN DD *
/*
