//TECN086D JOB ('DEV'),'ALLEN',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//DD01     DD  DSN=TECN086.MYDATA.PS2,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
//STEP2    EXEC PGM=IEFBR14
//DD01     DD  DSN=TECN086.MYDATA.PDS2,DISP=(NEW,CATLG,DELETE),
//             SPACE=(TRK,(1,1,5)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)