//TEKUS00@ JOB NOTIFY=&SYSUID
//JOBLIB DD DSN=TEKUS00.MYLIB.LOADLIB,DISP=SHR
//STEP1 EXEC PGM=COBCS03M
//INPOLPS  DD DSN=TEKUS00.MYDATA.CS03.PS1,DISP=SHR
//OUTPOLPS DD DSN=TEKUS00.MYDATA.CS03.KSDS,DISP=SHR
//SYSIN DD *
/*
