        IDENTIFICATION DIVISION.
        PROGRAM-ID. DBEX07.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
            EXEC SQL INCLUDE SQLCA END-EXEC.
            EXEC SQL INCLUDE DCLBANK END-EXEC.
        01 WS-BANK.
            05 WS-ACC-NO       PIC  9(09).
            05 WS-ACC-NAME     PIC  X(20).
            05 WS-ACC-TYPE     PIC  X(07).
            05 WS-ACC-AMT      PIC  9(6)V9(2).
        PROCEDURE DIVISION.
        0000-MAIN-PARA.
                 PERFORM 1000-INITIALIZATION-PARA THRU
                 1000-INITIALIZATION-PARA-EXIT
                 PERFORM 2000-PROCESS-PARA THRU
                 2000-PROCESS-PARA-EXIT
                 PERFORM 9000-TERMINATION-PARA THRU
                 9000-TERMINATION-PARA-EXIT.
        0000-MAIN-PARA-EXIT.
                 EXIT.
        1000-INITIALIZATION-PARA.
        1000-INITIALIZATION-PARA-EXIT.
                 EXIT.
        2000-PROCESS-PARA.
                 PERFORM 2300-SELECT-PARA THRU
                 2300-SELECT-PARA-EXIT.
        2000-PROCESS-PARA-EXIT.
                 EXIT.
        2300-SELECT-PARA.
                 EXEC SQL SELECT ACCNO,
                 ACCNAME, ACCTYP, ACCAMT INTO :ACCNO, :ACCNAME,
                 :ACCTYP, :ACCAMT FROM BANKDET
                 WHERE ACCNO = 1115
                 END-EXEC.
                 PERFORM 2400-DISPLAY-PARA THRU
                 2400-DISPLAY-PARA-EXIT.
        2300-SELECT-PARA-EXIT.
                 EXIT.
        2400-DISPLAY-PARA.
                 MOVE ACCNO TO WS-ACC-NO
                 MOVE ACCNAME TO WS-ACC-NAME
                 MOVE ACCTYP TO WS-ACC-TYPE
                 MOVE ACCAMT TO WS-ACC-AMT
                 DISPLAY WS-ACC-NO
                 DISPLAY WS-ACC-NAME
                 DISPLAY WS-ACC-TYPE
                 DISPLAY WS-ACC-AMT.
        2400-DISPLAY-PARA-EXIT.
                 EXIT.
        9000-TERMINATION-PARA.
                 STOP RUN.
        9000-TERMINATION-PARA-EXIT.
                 EXIT.
